

buy_success = {'entrust_no': '321818'}

position = [
    {'明细': '', '证券代码': '128053', '证券名称': '尚荣转债', '股票余额': 0, '实际数量': 0, '可用余额': 0, '冻结数量': 0, '成本价': 0.0, '市价': 241.011, '盈亏': -16.48, '盈亏比(%)': 0.0, '当日盈亏': 0.0, '当日盈亏比(%)': 0.0, '市值': 0.0, '仓位占比(%)': 0.0, '交易市场': '深Ａ', 'Unnamed: 16': ''}
]


today_entrusts = [
    {'委托时间': '12:43:29', '证券代码': '128053', '证券名称': '尚荣转债', '操作': '买入', '备注': '已撤', '委托数量': 10, '成交数量': 0, '委托价格': 235.0, '成交均价': 0.0, '撤消数量': 10, '合同编号': '225439', '交易市场': '深Ａ', '股东帐户': 149199787, 'Unnamed: 13': ''}, 
    {'委托时间': '12:59:52', '证券代码': '128053', '证券名称': '尚荣转债', '操作': '买入', '备注': '已撤', '委托数量': 10, '成交数量': 0, '委托价格': 230.0, '成交均价': 0.0, '撤消数量': 10, '合同编号': '226137', '交易市场': '深Ａ', '股东帐户': 149199787, 'Unnamed: 13': ''}, 
    {'委托时间': '13:07:29', '证券代码': '128053', '证券名称': '尚荣转债', '操作': '买入', '备注': '已成', '委托数量': 10, '成交数量': 10, '委托价格': 245.0, '成交均价': 242.454, '撤消数量': 0, '合同编号': '231406', '交易市场': '深Ａ', '股东帐户': 149199787, 'Unnamed: 13': ''}, 
    {'委托时间':'13:09:37', '证券代码': '128053', '证券名称': '尚荣转债', '操作': '卖出', '备注': '已成', '委托数量': 10, '成交数量': 10, '委托价格': 240.0, '成交均价': 240.83, '撤消数量': 0, '合同编号': '233215', '交易市场': '深Ａ', '股东帐户': 149199787, 'Unnamed: 13': ''}
    {'委托时间': '14:24:15', '证券代码': '128053', '证券名称': '尚荣转债', '操作': '买入', '备注': '已报', '委托数量': 10, '成交数量': 0, '委托价格': 230.0, '成交均价': 0.0, '撤消数量': 0, '合同编号': '311227', '交易市场': '深Ａ', '股东帐户': 149199787, 'Unnamed: 13': ''}
]

cancel_entrusts_success = {'message': '您的撤单委托已成功提交，合同编号：226137。'}
cancel_entrusts_fail = {'message': '委托单状态错误不能撤单, 该委托单可能已经成交或者已撤'}

